<?xml version="1.0" ?>
<net name="CraterUNet" version="10">
	<layers>
		<layer id="0" name="inc.double_conv.0.weight" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,1,256,256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx_initializer_node_inc.double_conv.0.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="112,1,3,3" size="2016"/>
			<output>
				<port id="1" precision="FP16">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims736/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2016" shape="1,112,1,1" size="224"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="onnx_initializer_node_inc.double_conv.2.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="2240" shape="112,112,3,3" size="225792"/>
			<output>
				<port id="1" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_2/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_2/Dims712/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="228032" shape="1,112,1,1" size="224"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_2" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="MaxPool_4" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx_initializer_node_down1.maxpool_conv.1.double_conv.0.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="228256" shape="224,112,3,3" size="451584"/>
			<output>
				<port id="1" precision="FP16">
					<dim>224</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_5/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>224</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_5/Dims724/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="679840" shape="1,224,1,1" size="448"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_5" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Relu_6" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="onnx_initializer_node_down1.maxpool_conv.1.double_conv.2.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="680288" shape="224,224,3,3" size="903168"/>
			<output>
				<port id="1" precision="FP16">
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_7/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_7/Dims772/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1583456" shape="1,224,1,1" size="448"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_7" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Relu_8" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="MaxPool_9" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="onnx_initializer_node_down2.maxpool_conv.1.double_conv.0.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="1583904" shape="448,224,3,3" size="1806336"/>
			<output>
				<port id="1" precision="FP16">
					<dim>448</dim>
					<dim>224</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_10/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>448</dim>
					<dim>224</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_10/Dims760/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3390240" shape="1,448,1,1" size="896"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_10" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>448</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Relu_11" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="onnx_initializer_node_down2.maxpool_conv.1.double_conv.2.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="3391136" shape="448,448,3,3" size="3612672"/>
			<output>
				<port id="1" precision="FP16">
					<dim>448</dim>
					<dim>448</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_12/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>448</dim>
					<dim>448</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_12/Dims706/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="7003808" shape="1,448,1,1" size="896"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_12" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>448</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Relu_13" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="MaxPool_14" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="onnx_initializer_node_down3.maxpool_conv.1.double_conv.0.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="7004704" shape="448,448,3,3" size="3612672"/>
			<output>
				<port id="1" precision="FP16">
					<dim>448</dim>
					<dim>448</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>448</dim>
					<dim>448</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_15/Dims730/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="10617376" shape="1,448,1,1" size="896"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_15" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>448</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Relu_16" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="onnx_initializer_node_down3.maxpool_conv.1.double_conv.2.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="10618272" shape="448,448,3,3" size="3612672"/>
			<output>
				<port id="1" precision="FP16">
					<dim>448</dim>
					<dim>448</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>448</dim>
					<dim>448</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_17/Dims742/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="14230944" shape="1,448,1,1" size="896"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_17" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>448</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Relu_18" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Interpolate/Resize_19/Cast_12490_const" type="Const" version="opset1">
			<data element_type="i64" offset="14231840" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Interpolate/Resize_19" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="nearest" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Concat_20" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>448</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>896</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="onnx_initializer_node_up1.conv.double_conv.0.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="14231856" shape="224,896,3,3" size="3612672"/>
			<output>
				<port id="1" precision="FP16">
					<dim>224</dim>
					<dim>896</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_21/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>896</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>224</dim>
					<dim>896</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_21/Dims754/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="17844528" shape="1,224,1,1" size="448"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_21" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Relu_22" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="onnx_initializer_node_up1.conv.double_conv.2.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="17844976" shape="224,224,3,3" size="903168"/>
			<output>
				<port id="1" precision="FP16">
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_23/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_23/Dims718/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="18748144" shape="1,224,1,1" size="448"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_23" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Relu_24" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Interpolate/Resize_25/Cast_12492_const" type="Const" version="opset1">
			<data element_type="i64" offset="18748592" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Interpolate/Resize_25" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="nearest" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Concat_26" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>448</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="onnx_initializer_node_up2.conv.double_conv.0.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="18748608" shape="112,448,3,3" size="903168"/>
			<output>
				<port id="1" precision="FP16">
					<dim>112</dim>
					<dim>448</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_27/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>448</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_27/Dims766/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="19651776" shape="1,112,1,1" size="224"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_27" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Relu_28" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="onnx_initializer_node_up2.conv.double_conv.2.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="19652000" shape="112,112,3,3" size="225792"/>
			<output>
				<port id="1" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_29/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_29/Dims778/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="19877792" shape="1,112,1,1" size="224"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_29" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Relu_30" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Interpolate/Resize_31/Cast_12494_const" type="Const" version="opset1">
			<data element_type="i64" offset="19878016" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Interpolate/Resize_31" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="nearest" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Concat_32" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>224</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="onnx_initializer_node_up3.conv.double_conv.0.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="19878032" shape="112,224,3,3" size="451584"/>
			<output>
				<port id="1" precision="FP16">
					<dim>112</dim>
					<dim>224</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_33/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>224</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_33/Dims784/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="20329616" shape="1,112,1,1" size="224"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_33" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Relu_34" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx_initializer_node_up3.conv.double_conv.2.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="20329840" shape="112,112,3,3" size="225792"/>
			<output>
				<port id="1" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_35/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>112</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_35/Dims790/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="20555632" shape="1,112,1,1" size="224"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_35" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Relu_36" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="onnx_initializer_node_outc.conv.bias/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="20555856" shape="1,112,1,1" size="224"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_37/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_37/Dims748/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="20556080" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_37" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_37/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="27" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="29" to-port="0"/>
		<edge from-layer="28" from-port="1" to-layer="29" to-port="1"/>
		<edge from-layer="29" from-port="2" to-layer="31" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="31" to-port="1"/>
		<edge from-layer="31" from-port="2" to-layer="32" to-port="0"/>
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="1" to-layer="35" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="35" to-port="1"/>
		<edge from-layer="35" from-port="2" to-layer="37" to-port="0"/>
		<edge from-layer="36" from-port="1" to-layer="37" to-port="1"/>
		<edge from-layer="37" from-port="2" to-layer="38" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="40" to-port="0"/>
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="42" to-port="0"/>
		<edge from-layer="41" from-port="1" to-layer="42" to-port="1"/>
		<edge from-layer="42" from-port="2" to-layer="43" to-port="0"/>
		<edge from-layer="43" from-port="1" to-layer="45" to-port="0"/>
		<edge from-layer="44" from-port="1" to-layer="45" to-port="1"/>
		<edge from-layer="32" from-port="1" to-layer="46" to-port="0"/>
		<edge from-layer="45" from-port="2" to-layer="46" to-port="1"/>
		<edge from-layer="46" from-port="2" to-layer="48" to-port="0"/>
		<edge from-layer="47" from-port="1" to-layer="48" to-port="1"/>
		<edge from-layer="48" from-port="2" to-layer="50" to-port="0"/>
		<edge from-layer="49" from-port="1" to-layer="50" to-port="1"/>
		<edge from-layer="50" from-port="2" to-layer="51" to-port="0"/>
		<edge from-layer="51" from-port="1" to-layer="53" to-port="0"/>
		<edge from-layer="52" from-port="1" to-layer="53" to-port="1"/>
		<edge from-layer="53" from-port="2" to-layer="55" to-port="0"/>
		<edge from-layer="54" from-port="1" to-layer="55" to-port="1"/>
		<edge from-layer="55" from-port="2" to-layer="56" to-port="0"/>
		<edge from-layer="56" from-port="1" to-layer="58" to-port="0"/>
		<edge from-layer="57" from-port="1" to-layer="58" to-port="1"/>
		<edge from-layer="21" from-port="1" to-layer="59" to-port="0"/>
		<edge from-layer="58" from-port="2" to-layer="59" to-port="1"/>
		<edge from-layer="59" from-port="2" to-layer="61" to-port="0"/>
		<edge from-layer="60" from-port="1" to-layer="61" to-port="1"/>
		<edge from-layer="61" from-port="2" to-layer="63" to-port="0"/>
		<edge from-layer="62" from-port="1" to-layer="63" to-port="1"/>
		<edge from-layer="63" from-port="2" to-layer="64" to-port="0"/>
		<edge from-layer="64" from-port="1" to-layer="66" to-port="0"/>
		<edge from-layer="65" from-port="1" to-layer="66" to-port="1"/>
		<edge from-layer="66" from-port="2" to-layer="68" to-port="0"/>
		<edge from-layer="67" from-port="1" to-layer="68" to-port="1"/>
		<edge from-layer="68" from-port="2" to-layer="69" to-port="0"/>
		<edge from-layer="69" from-port="1" to-layer="71" to-port="0"/>
		<edge from-layer="70" from-port="1" to-layer="71" to-port="1"/>
		<edge from-layer="10" from-port="1" to-layer="72" to-port="0"/>
		<edge from-layer="71" from-port="2" to-layer="72" to-port="1"/>
		<edge from-layer="72" from-port="2" to-layer="74" to-port="0"/>
		<edge from-layer="73" from-port="1" to-layer="74" to-port="1"/>
		<edge from-layer="74" from-port="2" to-layer="76" to-port="0"/>
		<edge from-layer="75" from-port="1" to-layer="76" to-port="1"/>
		<edge from-layer="76" from-port="2" to-layer="77" to-port="0"/>
		<edge from-layer="77" from-port="1" to-layer="79" to-port="0"/>
		<edge from-layer="78" from-port="1" to-layer="79" to-port="1"/>
		<edge from-layer="79" from-port="2" to-layer="81" to-port="0"/>
		<edge from-layer="80" from-port="1" to-layer="81" to-port="1"/>
		<edge from-layer="81" from-port="2" to-layer="82" to-port="0"/>
		<edge from-layer="82" from-port="1" to-layer="84" to-port="0"/>
		<edge from-layer="83" from-port="1" to-layer="84" to-port="1"/>
		<edge from-layer="84" from-port="2" to-layer="86" to-port="0"/>
		<edge from-layer="85" from-port="1" to-layer="86" to-port="1"/>
		<edge from-layer="86" from-port="2" to-layer="87" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value=""/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<data_type value="FP16"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="False"/>
			<generate_experimental_IR_V10 value="True"/>
			<input_model value="DIR\CraterUNet.onnx"/>
			<input_shape value="[1,1,256,256]"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="CraterUNet"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[  1   1 256 256]"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, output, scale, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
